"""
This module contains the functions used in the Wordle Results Emoji
Swapper

Author: Scott Fukuda
Date: 9/21/24
"""

def is_valid_emoji(s):
    """
    Returns True if character equals '🟩', '🟨', or '⬛' and False if not.
    """
    if (s == '🟩'):
        return True
    elif (s == '🟨'):
        return True
    elif (s == '⬛'):
        return True
    return False

def circumcise(s):
    """
    Returns string with every character removed that comes before
    the first '🟩', '🟨', or '⬛'. If s does not contain '🟩', '🟨', or '⬛',
    then it returns an empty string.
    """
    while True:
        if is_valid_emoji(s[0]):
            return s
        s = s[1:]
        if s == '':
            return s

def replace(old, new, s):
    """
    Returns "new" in place of every occurence of "old" in the string "s".

    Old, new, and s must all be strings
    """
    # runs while old is present in the string
    while (s.find(old) != -1):
        # finds index of first occurence of "old" in "s"
        first_old = s.find(old)
        # assigns all up to first_old
        start = s[:first_old]
        # assigns all after first_old
        end = s[first_old+1:]
        # replaces
        s = start+new+end
        ### print(s)
    return s

def emoji_swap(user_green, user_yellow, user_grey, s):
    s = replace('🟩', user_green, s)
    s = replace('🟨', user_yellow, s)
    s = replace('⬛', user_grey, s)
    return s

emoji_list = [
    "😀", "😁", "😂", "🤣", "😃", "😄", "😅", "😆", "😇", "😈", "😉", "😊", "😋", "😌",
    "😍", "😎", "😏", "😐", "😑", "😒", "😓", "😔", "😕", "😖", "😗", "😘", "😙", "😚",
    "😛", "😜", "😝", "😞", "😟", "😠", "😡", "😢", "😣", "😤", "😥", "😦", "😧",
    "😨", "😩", "😪", "😫", "😬", "😭", "😮", "😯", "😰", "😱", "😲", "😳", "😵",
    "😶", "😷", "😸", "😹", "😺", "😻", "😼", "😽", "😾", "😿", "🙀", "🙁", "🙃",
    "🙂", "🙄", "🙅", "🙆", "🙇", "🙈", "🙉", "🙊", "🙋", "🙌", "🙍", "🙎", "🙏",
    "🚀", "🚁", "🚂", "🚃", "🚄", "🚅", "🚆", "🚇", "🚈", "🚉", "🚊", "🚋", "🚌",
    "🚍", "🚎", "🚏", "🚐", "🚑", "🚒", "🚓", "🚔", "🚕", "🚖", "🚗", "🚘", "🚙",
    "🚌", "🚚", "🚛", "🚜", "🚝", "🚞", "🚟", "🚠", "🚡", "🚢", "⛴️", "🛳️", "🚤",
    "🛶", "⚓", "🏍️", "🛵", "🚲", "🛴", "🦽", "🦯", "🚏", "🚦", "🚧", "⛽", "🏁",
    "🚦", "🚥", "⚠️", "🛑", "🚸", "🚮", "🚰", "🚱", "🚳", "🚴", "🚵", "🏇", "🏁",
    "⛷️", "🏂", "🏌️", "🏋️", "🤼", "🤸", "⛹️", "🏋️", "🏊", "🤽", "🤾", "🏆",
    "🏅", "🎖️", "🥇", "🥈", "🥉", "🎗️", "🏵️", "🎟️", "🎫", "🎠", "🎡", "🎢",
    "🎪", "🤹", "🎼", "🎧", "🎤", "🎸", "🎹", "🎻", "🎺", "🎷", "🎊", "🎉", "🎈",
    "🎂", "🍰", "🧁", "🍩", "🍪", "🍫", "🍬", "🍭", "🍮", "🍯", "🍨", "🍦", "🥧",
    "🥮", "🍉", "🍇", "🍈", "🍊", "🍋", "🍌", "🍍", "🍎", "🍏", "🍐", "🍑", "🍒",
    "🍓", "🥝", "🥥", "🥭", "🍅", "🍆", "🥑", "🥕", "🌽", "🥔", "🥬", "🌶️", "🥒",
    "🌽", "🧄", "🧅", "🍠", "🍳", "🍚", "🍙", "🍜", "🍝", "🍞", "🥖", "🥯", "🥪",
    "🌮", "🌯", "🍕", "🍔", "🍟", "🍗", "🍖", "🍤", "🍙", "🍣", "🍱", "🥗", "🍘",
    "🍚", "🍛", "🍜", "🍲", "🍥", "🍙", "🥘", "🍧", "🍨", "🍦", "🍰", "🎂", "🍮",
    "🍯", "🍬", "🍭", "🍫", "🍿", "🎃", "🧙‍♂️", "🧙‍♀️", "🧚‍♂️", "🧚‍♀️", "🧜‍♂️",
    "🧜‍♀️", "🧝‍♂️", "🧝‍♀️", "🧞‍♂️", "🧞‍♀️", "🧟‍♂️", "🧟‍♀️", "💃", "🕺",
    "🕴️", "👯‍♂️", "👯‍♀️", "🕵️", "🕵️‍♀️", "👩‍🔬", "👩‍🎤", "👩‍🍳", "👩‍🏫",
    "👩‍🎓", "👩‍🔧", "👩‍🔬", "👨‍🔧", "👨‍🔬", "👨‍🎓", "👨‍🍳", "👨‍🏫", "👨‍🎤",
    "🤵", "👰", "👸", "🤴", "🦸‍♂️", "🦸‍♀️", "🦹‍♂️", "🦹‍♀️", "🧑‍🚀", "🧑‍🚒",
    "👮‍♂️", "👮‍♀️", "👷‍♂️", "👷‍♀️", "💁‍♂️", "💁‍♀️", "🙆‍♂️", "🙆‍♀️", "🙅‍♂️",
    "🙅‍♀️", "💆‍♂️", "💆‍♀️", "🧖‍♂️", "🧖‍♀️", "🧘‍♂️", "🧘‍♀️", "🤹‍♂️", "🤹‍♀️", "💔", "❤️",
    "🧡", "💛", "💚", "💙", "💜", "🤎", "🖤", "🤍", "💖", "💗", "💓", "💞", "💕",
    "💌", "💋", "💘", "💝", "💖", "🌹", "🌺", "🌻", "🌼", "🌸", "🌷"]
